Catalogs/упПоказателиРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упПоказателиРасчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПараметрРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упПараметрыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыПоказателейРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗаменятьНаРазмер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияПараметра</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упВидыПеревозок</v8:Type>
								<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
								<v8:Type>cfg:CatalogRef.упТипыТС</v8:Type>
								<v8:Type>cfg:CatalogRef.упТемпературныеРежимы</v8:Type>
								<v8:Type>cfg:CatalogRef.упТипыГрузов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упПараметрыРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упПараметрыРасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВидПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяНачалаПогрузкиПлановое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяНачалаПогрузкиФактическое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяНачалаРазгрузкиПлановое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяНачалаРазгрузкиФактическое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяОкончанияПогрузкиПлановое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяОкончанияПогрузкиФактическое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяОкончанияРазгрузкиПлановое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяОкончанияРазгрузкиФактическое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяОтправленияПоПлановое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяОтправленияСПлановое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяПолученияПоПлановое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяПолученияСПлановое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяПростояПоВинеЗаказчикаЧасы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяПростояПоВинеПеревозчикаЧасы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоОтопитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяРаботыЧас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрузоподъемностьТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗонаОтправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗонаПолучения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеРасходаТопливаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоЗагрузочныхМетровГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоЗагрузочныхМетровТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоМестГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоМестТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоТочекВМаршруте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоТочекПогрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоТочекРазгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МассаГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаОтопитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъемГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъемныйВес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъемТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценочнаяСтоимостьГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлановаяСуммаИнкассации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлановыеРасходыПоПеревозке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредполагаемаяСтоимостьПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расстояние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рейс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТемператураВоздуха</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТемпературныйРежим</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФактическиеРасходыПоЗаявке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоЗаданийСРаботамиПоПеревозкеГрузаВМаршруте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтоНормаРасходаТопливаНа100км</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтоНормаРасходаТопливаНа1часРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаГорнаяМестность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаГрузовой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаДлительнаяЭксплуатация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаЗимний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаКлиматКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаКондиционер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаНаселенныйПункт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаПростой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаСложностьДорог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаРасходаТопливаСпециальноеОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоГорнаяМестность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоГрузовой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоДлительнаяЭксплуатация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоТопливаЗимний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоКлиматКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоКондиционер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоНаселенныйПункт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоПростой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоСложностьДорог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоСпециальноеОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтоПлановыйРасчетТоплива</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтоНормативныйРасчетТоплива</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтоРасчетТопливаПоДопОборудованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Моточасы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МоточасыСГрузом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПробегСГрузом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МассаПрицепногоСостава</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упТипыПоказателейРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыПоказателейРасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Расчетный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фиксированный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упТипРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипРасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Тарификация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Топливо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упПоказателиРасчета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.Добавить("Код");
	Поля.Добавить("Наименование");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Представление = Данные.Наименование + " [" + СокрЛП(Данные.Код) + "]";
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

// Процедура - Заполнить предопределенный показатель рейс
//
// Параметры:
//  Отказ	 - 	Булево - возвращает состояние процесса заполнения.
//
Процедура ЗаполнитьПредопределенныйПоказательРейс(Отказ) Экспорт
	
	ПоказательРейсОбъект = Справочники.упПоказателиРасчета.Рейс.ПолучитьОбъект();
	
	ЕстьИзменения = НЕ (ПоказательРейсОбъект.ПараметрРасчета 	= Перечисления.упПараметрыРасчета.Рейс
						И ПоказательРейсОбъект.ТипПоказателя 	= Перечисления.упТипыПоказателейРасчета.Расчетный
						И ПоказательРейсОбъект.Код 				= "Рейс"
						И ПоказательРейсОбъект.ТипРасчета 		= Перечисления.упТипРасчета.Тарификация);
	
	Если ЕстьИзменения Тогда
		Попытка
			ПоказательРейсОбъект.ПараметрРасчета 	= Перечисления.упПараметрыРасчета.Рейс;
			ПоказательРейсОбъект.ТипПоказателя 		= Перечисления.упТипыПоказателейРасчета.Расчетный;
			ПоказательРейсОбъект.Код 				= "Рейс";
			ПоказательРейсОбъект.ТипРасчета 		= Перечисления.упТипРасчета.Тарификация;
			ПоказательРейсОбъект.Записать();
		Исключение
			Отказ = Истина;
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда 
				ТекстОшибки = ОписаниеОшибки();
			КонецЕсли;
			ЗаписьЖурналаРегистрации("ОшибкаПриЗаписиПоказателяРасчета", УровеньЖурналаРегистрации.Ошибка, ,ПоказательРейсОбъект.Ссылка, ТекстОшибки, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
